; domain
;Header and description

(define (domain stationary_object_sorting)

;remove requirements that are not needed
(:requirements :strips :typing)

(:types ;todo: enumerate types and their hierarchy here, e.g. car truck bus - vehicle
    robot - object
    box - object
    red_box - box
    black_box - box
    table - object
    goal_table - table
    free_table - table
    init_table - table
)

; un-comment following line if constants are needed
(:constants 
    box_0 - red_box
    box_1 - black_box
    box_2 - black_box
    box_3 - black_box
)

(:predicates ;todo: define predicates here
    (free ?r - robot)
    (holding ?r - robot ?b - box)
    (ready-to-move ?r - robot)

    (moved-to-object ?r - robot ?b - box)
    (moved-to-table ?r - robot ?b - box ?t - table)

    (on ?b - box ?t - table)

    (unobstructed ?b1 - box ?b2 - box)

)


; (:functions ;todo: define numeric functions here

; )

;define actions here
(:action move-to-object-top
    :parameters (?r - robot ?b - box ?t - init_table)
    :precondition (and 
        (free ?r)
        (ready-to-move ?r)
        (on ?b ?t)

        (unobstructed ?b box_0)
        (unobstructed ?b box_1)
        (unobstructed ?b box_2)
        (unobstructed ?b box_3)
    )
    :effect (and 
        (not (ready-to-move ?r))
        (moved-to-object ?r ?b)
        (not (on ?b ?t))
    )
)

(:action move-to-object-side
    :parameters (?r - robot ?b - box ?t - init_table)
    :precondition (and 
        (free ?r)
        (ready-to-move ?r)
        (on ?b ?t)

        (unobstructed ?b box_0)
        (unobstructed ?b box_1)
        (unobstructed ?b box_2)
        (unobstructed ?b box_3)
    )
    :effect (and 
        (not (ready-to-move ?r))
        (moved-to-object ?r ?b)
        (not (on ?b ?t))
    )
)

(:action grasp
    :parameters (?r - robot ?b - box)
    :precondition (and 
        (free ?r)
        (moved-to-object ?r ?b)
    )
    :effect (and 
        (not (free ?r))
        (holding ?r ?b)
        (not (moved-to-object ?r ?b))
        (ready-to-move ?r)

        (unobstructed box_0 ?b)
        (unobstructed box_1 ?b)
        (unobstructed box_2 ?b)
        (unobstructed box_3 ?b)
    )
)

(:action move-to-goal-table
    :parameters (?r - robot ?b - red_box ?t - goal_table)
    :precondition (and 
        (holding ?r ?b)
        (ready-to-move ?r)
    )
    :effect (and 
        (moved-to-table ?r ?b ?t)
        (not (ready-to-move ?r))
    )
)

(:action move-to-free-table
    :parameters (?r - robot ?b - black_box ?t - free_table)
    :precondition (and 
        (holding ?r ?b)
        (ready-to-move ?r)
    )
    :effect (and 
        (moved-to-table ?r ?b ?t)
        (not (ready-to-move ?r))
    )
)

(:action release
    :parameters (?r - robot ?b - box ?t - table)
    :precondition (and
        (moved-to-table ?r ?b ?t)
    )
    :effect (and
        (free ?r)
        (ready-to-move ?r)
        (not (holding ?r ?b))
        (on ?b ?t)
        (not (moved-to-table ?r ?b ?t))
    )
)


)

; problem
(define (problem 3obj_problem) (:domain stationary_object_sorting)
(:objects
    iiwa - robot

    table_0 - init_table
    table_1 - goal_table
    table_2 - free_table
)

(:init
    ;todo: put the initial state's facts and numeric values here
    (free iiwa)
    (ready-to-move iiwa)

    (on box_0 table_0)
    (on box_1 table_0)
    (on box_2 table_0)
    (on box_3 table_0)

    (unobstructed box_0 box_0)
    ; (unobstructed box_0 box_1)
    ; (unobstructed box_0 box_2)
    (unobstructed box_0 box_3)


    (unobstructed box_1 box_0)
    (unobstructed box_1 box_1)
    (unobstructed box_1 box_2)
    ; (unobstructed box_1 box_3)

    (unobstructed box_2 box_0)
    (unobstructed box_2 box_1)
    (unobstructed box_2 box_2)
    ; (unobstructed box_2 box_3)

    (unobstructed box_3 box_0)
    (unobstructed box_3 box_1)
    (unobstructed box_3 box_2)
    (unobstructed box_3 box_3)

)

(:goal (and
    ;todo: put the goal condition here
    (on box_0 table_1)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (move-to-object-side iiwa box_3 table_0)
   deleted: (ready-to-move iiwa) (on box_3 table_0)
   added: (moved-to-object iiwa box_3)
   goals met: 0 of 1
2. (grasp iiwa box_3)
   deleted: (free iiwa) (moved-to-object iiwa box_3)
   added: (holding iiwa box_3) (ready-to-move iiwa) (unobstructed box_1 box_3) (unobstructed box_2 box_3)
   goals met: 0 of 1
3. (move-to-free-table iiwa box_3 table_2)
   deleted: (ready-to-move iiwa)
   added: (moved-to-table iiwa box_3 table_2)
   goals met: 0 of 1
4. (release iiwa box_3 table_2)
   deleted: (holding iiwa box_3) (moved-to-table iiwa box_3 table_2)
   added: (free iiwa) (ready-to-move iiwa) (on box_3 table_2)
   goals met: 0 of 1
5. (move-to-object-side iiwa box_1 table_0)
   deleted: (ready-to-move iiwa) (on box_1 table_0)
   added: (moved-to-object iiwa box_1)
   goals met: 0 of 1
6. (grasp iiwa box_1)
   deleted: (free iiwa) (moved-to-object iiwa box_1)
   added: (holding iiwa box_1) (ready-to-move iiwa) (unobstructed box_0 box_1)
   goals met: 0 of 1
7. (move-to-free-table iiwa box_1 table_2)
   deleted: (ready-to-move iiwa)
   added: (moved-to-table iiwa box_1 table_2)
   goals met: 0 of 1
8. (release iiwa box_1 table_2)
   deleted: (holding iiwa box_1) (moved-to-table iiwa box_1 table_2)
   added: (free iiwa) (ready-to-move iiwa) (on box_1 table_2)
   goals met: 0 of 1
9. (move-to-object-side iiwa box_2 table_0)
   deleted: (ready-to-move iiwa) (on box_2 table_0)
   added: (moved-to-object iiwa box_2)
   goals met: 0 of 1
10. (grasp iiwa box_2)
   deleted: (free iiwa) (moved-to-object iiwa box_2)
   added: (holding iiwa box_2) (ready-to-move iiwa) (unobstructed box_0 box_2)
   goals met: 0 of 1
11. (move-to-free-table iiwa box_2 table_2)
   deleted: (ready-to-move iiwa)
   added: (moved-to-table iiwa box_2 table_2)
   goals met: 0 of 1
12. (release iiwa box_2 table_2)
   deleted: (holding iiwa box_2) (moved-to-table iiwa box_2 table_2)
   added: (free iiwa) (ready-to-move iiwa) (on box_2 table_2)
   goals met: 0 of 1
13. (move-to-object-side iiwa box_0 table_0)
   deleted: (ready-to-move iiwa) (on box_0 table_0)
   added: (moved-to-object iiwa box_0)
   goals met: 0 of 1
14. (grasp iiwa box_0)
   deleted: (free iiwa) (moved-to-object iiwa box_0)
   added: (holding iiwa box_0) (ready-to-move iiwa)
   goals met: 0 of 1
15. (move-to-goal-table iiwa box_0 table_1)
   deleted: (ready-to-move iiwa)
   added: (moved-to-table iiwa box_0 table_1)
   goals met: 0 of 1
16. (release iiwa box_0 table_1)
   deleted: (holding iiwa box_0) (moved-to-table iiwa box_0 table_1)
   added: (free iiwa) (ready-to-move iiwa) (on box_0 table_1)
   goals met: 1 of 1
